#+TITLE: FilingForest
Do you worry how current media and
trust in information will desolve?
Do these questions keep you up at night,
like me?

After the age of information?
Will come a golden age?
Of growth?

What is the terrain for digital growth?

* FERTIG The Information Mycelium
CLOCK: [2021-01-29 Fr 00:22]--[2021-01-29 Fr 00:31] =>  0:09
:END:

** Git
:PROPERTIES:
:CLOCK_LAST: [2021-01-26 Di 12:30]
:END:
:LOGBOOK:
CLOCK: [2021-01-20 Mi 12:44]--[2021-01-26 Di 12:30] => 143:46
:END:
Git is a software that can integrate collaborative writing
by thousands of authors.
- cryptographic signing off (claim authorship)
- moderation
- flexible team workflows

Git is well established:
Stand on the shoulders of Linus Torvalds,
the giant.

*** =git init= creates new repositories
:PROPERTIES:
:CLOCK_LAST: [2021-01-26 Di 12:38]
:END:
:LOGBOOK:
CLOCK: [2021-01-26 Di 12:35]--[2021-01-26 Di 12:38] =>  0:03
CLOCK: [2021-01-26 Di 12:30]--[2021-01-26 Di 12:33] =>  0:03
:END:
Let's start fresh
in Linux, 
#+begin_src sh
rm -rf demo-repository
mkdir demo-repository
#+end_src

#+results:
:results:
:end:


You can convert any existing folder
into a git repository:
#+begin_src sh
cd demo-repository
git init
#+end_src

#+results:
:results:
Initialized empty Git repository in /home/gregor/dev/julia/OrGitBot/repositories/InformationMycele/demo-repository/.git/
:end:


Suppose some text file
[[file:./demo-repository/info.org]]
in orgmode markup format:
#+begin_src sh
echo "* DONE some demo notes\n(for git)" > demo-repository/info.org
#+end_src

#+results:
:results:
:end:
You can then
*** =git add= and =git commit=
:PROPERTIES:
:CLOCK_LAST: [2021-01-28 Do 23:48]
:END:
:LOGBOOK:
CLOCK: [2021-01-26 Di 12:38]--[2021-01-28 Do 23:48] => 59:10
:END:
files and subfolders.

Let's register the first version
of the file in your folder!
That task is broken up into two basic operations,
- add :: so you can refine,
  select and group changes together, and
- commit :: so you can comment on a set of changes.

I use Magit (emacs again): not a requirement.

=M-x magit-status= 

There are unstaged changes:
- I mark some changes and =M-x =magit-stage=.
  Staging files can be done without magit in the terminal:
  #+begin_src sh
  git add info.org
  #+end_src
- =M-x magit-commit= staged changes and write a comment.
  Commiting can be done in the terminal too:
  #+begin_src sh
  git commit -m "a note describing the changes"
  #+end_src
- We look at the log of this repository with =M-x magit-log= and selecting a simple log format.

Let me repeat:
1. Change the =info.org= file.
2. M-x magit-status
3. New content is shown in green.
4. stage change
5. magit-commit with a comment

As long as you version your work
on your own that is all you need to know.
* =git clone= repositories
:PROPERTIES:
:CLOCK_LAST: [2021-01-29 Fr 18:45]
:END:
:LOGBOOK:
CLOCK: [2021-01-29 Fr 18:34]--[2021-01-29 Fr 18:45] =>  0:11
:END:
There are many ways to publish your content for collaboration.
Let's first look at something simple for starters, something established and convenient:
** https://GitHub.com
:PROPERTIES:
:CLOCK_LAST: [2021-01-29 Fr 18:56]
:END:
:LOGBOOK:
CLOCK: [2021-01-29 Fr 18:45]--[2021-01-29 Fr 18:56] =>  0:11
:END:
is *the* central place for many git repositories - with a long history (today developed & owned by microsoft).
Most github repositories are programming - but never mind.

(this is literate shell programming:)
#+begin_src sh
git remote add origin git@github.com:gkappler/InformationMycelium.git
git branch -M main
git push -u origin main
#+end_src

#+results:
:results:
Branch 'main' set up to track remote branch 'main' from 'origin'.
:end:

So, it is this easy to publish your text files with emacs.
Well "publish" on GitHub as a repository, crude and ugly.

We will go further and pretty, I do hope!
Together, I do hope!

Let me conclude and repeat what we learned --
and publish the text of this brief tutorial.
* [[https://orgmode.org][org mode]]
:PROPERTIES:
:CLOCK_LAST: [2021-01-29 Fr 19:19]
:END:
:LOGBOOK:
CLOCK: [2021-01-29 Fr 19:16]--[2021-01-29 Fr 19:19] =>  0:03
CLOCK: [2021-01-29 Fr 19:10]--[2021-01-29 Fr 19:12] =>  0:02
CLOCK: [2021-01-29 Fr 18:56]--[2021-01-29 Fr 19:06] =>  0:10
:END:
your life in plain text.

I started using org in about 2009.
I never left again.
Wrote
- my private notes & plans
- scientific papers
- slides
- mails

I got addicted, and needed to learn how to consciously forget.
Now I hope I can share my love.

Org changed my writing.
It helped me focus.
** Org allows to markup and format
:PROPERTIES:
:CLOCK_LAST: [2021-01-29 Fr 19:16]
:END:
:LOGBOOK:
CLOCK: [2021-01-29 Fr 19:12]--[2021-01-29 Fr 19:16] =>  0:04
CLOCK: [2021-01-29 Fr 19:06]--[2021-01-29 Fr 19:10] =>  0:04
:END:
/italics/, *bold*, =code=
# comments (not printed when published)
: # escapes as a code line (printed when published)

Of course
1. lists
2. with enumations
3. and sublists
   - too
   - with just dashes

You really can write nearly everything in org.
But you will need emacs for a full experience.

